muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
#if DBG_PRINT_OUT_STATS
      {
        float out_mean = (float)out_sum / (float)probe_dim;
        float nrm = l2_norm(probe_f, probe_dim);
        int nan_cnt=0; for(int i=0;i<probe_dim;i++){ if(!isfinite(probe_f[i])) nan_cnt++; }
        printf("[FR][out] I8 stats: min=%d max=%d mean=%.1f  L2=%.3f  NaN=%d\r\n",
               out_min, out_max, out_mean, nrm, nan_cnt);
      }
#endif

      /* ----- Compare to reference set (Top-K and per-name Top3-mean) ----- */
      int   top_idx[8];   float top_val[8];
      const int K = (FR_TOPK <= 8 ? FR_TOPK : 8);
      for (int k=0;k<K;k++){ top_idx[k] = -1; top_val[k] = -2.0f; }

      /* Compute best per-name using mean of top-3 refs for that name */
      float best_name_score = -2.0f;
      const char *best_name_ptr = NULL;

      for (int i = 0; i < g_ref_set_count; ++i) {
        const char *nm = g_ref_set[i].name ? g_ref_set[i].name : "";
        if (!nm[0]) continue;

        /* collect top-3 scores for this name */
        float t1=-2.f, t2=-2.f, t3=-2.f;
        for (int j = 0; j < g_ref_set_count; ++j) {
          if (!g_ref_set[j].name) continue;
          if (strcmp(g_ref_set[j].name, nm) != 0) continue;
          int dim = (probe_dim < g_ref_set[j].dim) ? probe_dim : g_ref_set[j].dim;
          if (dim <= 0) continue;
          float s = cosine_sim(probe_f, g_ref_set[j].data, dim);

          /* maintain global Top-K of individual refs for debug */
          for (int k=0;k<K;k++){
            if (s > top_val[k]) {
              for (int m=K-1; m>k; --m) { top_val[m]=top_val[m-1]; top_idx[m]=top_idx[m-1]; }
              top_val[k] = s; top_idx[k] = j; break;
            }
          }

          /* in-name top3 */
          if (s > t1){ t3=t2; t2=t1; t1=s; }
          else if (s > t2){ t3=t2; t2=s; }
          else if (s > t3){ t3=s; }
        }

        float mean_top3;
        if (t2 < -1.0f) {
          /* fewer than 2 examples: use max only */
          mean_top3 = t1;
        } else if (t3 < -1.0f) {
          mean_top3 = (t1 + t2) * 0.5f;
        } else {
          mean_top3 = (t1 + t2 + t3) / 3.0f;
        }

        if (mean_top3 > best_name_score) {
          best_name_score = mean_top3;
          best_name_ptr   = nm;
        }
      }

      /* Candidate (by per-name Top3-mean) */
      const char *cand_name = (best_name_ptr && best_name_score > -1.0f) ? best_name_ptr : "Unknown";
      float       cand_s    = (best_name_score > -2.0f) ? best_name_score : 0.0f;

      /* Self-consistency with previous embedding */
      if (have_prev) {
        float sself = cosine_sim(probe_f, prev_emb, probe_dim);
        printf("[FR][self] cos(prev)=%.3f\r\n", sself);
      }
      memcpy(prev_emb, probe_f, probe_dim*sizeof(float)); have_prev = 1;

      /* ----- Hysteresis lock to avoid flicker ----- */
      const char *final_name = "Unknown";
      float final_s = cand_s;

      if (!lock.locked) {
        if (cand_s >= THR_ON && cand_name && cand_name[0]) {
          snprintf(lock.name, sizeof(lock.name), "%s", cand_name);
          lock.score = cand_s;
          lock.bad_frames = 0;
          lock.locked = 1;
        }
        final_name = lock.locked ? lock.name : "Unknown";
        final_s    = lock.locked ? cand_s   : cand_s;
      } else {
        if (cand_name && strcmp(cand_name, lock.name) == 0) {
          /* same identity candidate */
          if (cand_s >= THR_OFF) {
            lock.score = cand_s;
            lock.bad_frames = 0;
          } else {
            lock.bad_frames++;
            if (lock.bad_frames > FR_LOCK_FORGET_FRAMES) {
              lock.locked = 0;
              lock.name[0] = '\0';
            }
          }
        } else {
          /* different candidate */
          if (cand_s >= THR_ON && cand_s > lock.score + 0.05f) {
            snprintf(lock.name, sizeof(lock.name), "%s", cand_name);
            lock.score = cand_s;
            lock.bad_frames = 0;
            lock.locked = 1;
          } else {
            lock.bad_frames++;
            if (lock.bad_frames > FR_LOCK_FORGET_FRAMES) {
              lock.locked = 0;
              lock.name[0] = '\0';
            }
          }
        }
        final_name = lock.locked ? lock.name : ((cand_s >= THR_ON && cand_name)?cand_name:"Unknown");
        final_s    = lock.locked ? lock.score: cand_s;
      }

      /* Log result + Top-K */
      printf("[FR] match: %s  cos=%.3f  (dt=%lums)\r\n", final_name, final_s, (unsigned long)dt);

      if (strcmp(final_name, "Unknown") != 0 && final_s >= FR_THR_ON) {
          // Face recognized with enough confidence
          printf("[UI] Launching PIN screen for %s...\r\n", final_name);

          UI_PinScreen_Show("=== PIN SCREEN ===");
          UI_PinScreen_WaitForOK("1234");   // or whichever PIN is correct here


          printf("[UI] PIN screen done, resuming pipeline...\r\n");
      }

#if DBG_PRINT_TOPK
      if (K > 0) {
        printf("[FR][Top%d] ", K);
        for (int k=0;k<K;k++){
          if (top_idx[k] >= 0) {
            const char* nm = (g_ref_set[top_idx[k]].name && g_ref_set[top_idx[k]].name[0]) ? g_ref_set[top_idx[k]].name : "?";
            printf("%s:%.2f%s", nm, top_val[k], (k+1<K && top_idx[k+1]>=0) ? " | " : "\r\n");
          }
        }
      }
#endif

      /* Update overlay */
      snprintf((char*)g_fr_overlay_label, sizeof(g_fr_overlay_label), "%s  %.2f", final_name, final_s);
    }

    /* -------- publish detection only (overlay text is global) -------- */
    BaseType_t lock_sem = xSemaphoreTake(disp.lock, portMAX_DELAY);  assert(lock_sem == pdTRUE);

    if (primary.have) {
      disp.info.nb_detect = 1;
      disp.info.detects[0] = primary.roi;
    } else {
      disp.info.nb_detect = 0;
    }

    /* Ensure tracker overlay OFF so only one box is drawn */
    disp.info.tracking_enabled = 0;
#ifdef TRACKER_MODULE
    disp.info.tboxes_valid_nb = 0;
#endif
    disp.info.pp_ms = nn_pp[1] - nn_pp[0];

    lock_sem = xSemaphoreGive(disp.lock);  assert(lock_sem == pdTRUE);

    bqueue_put_free(&nn_output_queue);
    xSemaphoreGive(disp.update);
  }
}
